tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf45j11_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF45J11_H_
#define _PIC18LF45J11_H_

#define RPOR14                        0
#define RPOR14_RPOR                   1
#define RPOR15                        2
#define RPOR15_RPOR                   3
#define RPOR16                        4
#define RPOR16_RPOR                   5
#define PPSCON                        6
#define IOLOCK                        7
#define PADCFG1                       8
#define PMPTTL                        9
#define RTSECSEL0                     10
#define RTSECSEL1                     11
#define REFOCON                       12
#define RODIV0                        13
#define RODIV                         14
#define RODIV1                        15
#define RODIV2                        16
#define RODIV3                        17
#define ROSEL                         18
#define ROSSLP                        19
#define ROON                          20
#define RTCCAL                        21
#define CAL0                          22
#define CAL                           23
#define CAL1                          24
#define CAL2                          25
#define CAL3                          26
#define CAL4                          27
#define CAL5                          28
#define CAL6                          29
#define CAL7                          30
#define RTCCFG                        31
#define RTCPTR0                       32
#define RTCPTR1                       33
#define RTCOE                         34
#define HALFSEC                       35
#define RTCSYNC                       36
#define RTCWREN                       37
#define RTCEN                         38
#define ODCON3                        39
#define SPI1OD                        40
#define SPI2OD                        41
#define ODCON2                        42
#define U1OD                          43
#define U2OD                          44
#define ODCON1                        45
#define ECCP1OD                       46
#define ECCP2OD                       47
#define ANCON0                        48
#define PCFG0                         49
#define PCFG1                         50
#define PCFG2                         51
#define PCFG3                         52
#define PCFG4                         53
#define PCFG5                         54
#define PCFG6                         55
#define PCFG7                         56
#define ANCON1                        57
#define PCFG8                         58
#define PCFG9                         59
#define PCFG10                        60
#define PCFG11                        61
#define PCFG12                        62
#define PCFG14                        63
#define VBG2EN                        64
#define PCFG15                        65
#define VBGEN                         66
#define DSWAKEL                       67
#define DSPOR                         68
#define DSMCLR                        69
#define DSRTC                         70
#define DSWDT                         71
#define DSULP                         72
#define DSFLT                         73
#define DSWAKEH                       74
#define DSINT0                        75
#define DSCONL                        76
#define RELEASE                       77
#define DSBOR                         78
#define ULPWDIS                       79
#define DSCONH                        80
#define RTCWDIS                       81
#define DSULPEN                       82
#define DSEN                          83
#define DSGPR0                        84
#define DSGPR1                        85
#define TCLKCON                       86
#define T3CCP1                        87
#define T3CCP2                        88
#define T1RUN                         89
#define CVRCON                        90
#define CVR                           91
#define CVR0                          92
#define CVR1                          93
#define CVR2                          94
#define CVR3                          95
#define CVRSS                         96
#define CVRR                          97
#define CVROEN                        98
#define CVROE                         99
#define CVREN                         100
#define PMSTATL                       101
#define OB0E                          102
#define OB1E                          103
#define OB2E                          104
#define OB3E                          105
#define OBUF                          106
#define OBE                           107
#define PMSTATH                       108
#define IB0F                          109
#define IB1F                          110
#define IB2F                          111
#define IB3F                          112
#define IBOV                          113
#define IBF                           114
#define PMEL                          115
#define PTEN0                         116
#define PTENL                         117
#define PTEN1                         118
#define PTEN2                         119
#define PTEN3                         120
#define PTEN4                         121
#define PTEN5                         122
#define PTEN6                         123
#define PTEN7                         124
#define PMEH                          125
#define PTEN8                         126
#define PTENH                         127
#define PTEN9                         128
#define PTEN10                        129
#define PTEN11                        130
#define PTEN12                        131
#define PTEN13                        132
#define PTEN14                        133
#define PTEN15                        134
#define PMDIN2L                       135
#define PMDIN2L_DATAL                 136
#define PMDIN2H                       137
#define PMDIN2H_DATAH                 138
#define PMDOUT2L                      139
#define PMDOUT2L_DATAL                140
#define PMDOUT2H                      141
#define PMDOUT2H_DATAH                142
#define PMMODEL                       143
#define WAITE                         144
#define PMMODEL_WAITE0                145
#define PMMODEL_WAITE1                146
#define PMMODEL_WAITM0                147
#define WAITM                         148
#define PMMODEL_WAITM1                149
#define PMMODEL_WAITM2                150
#define PMMODEL_WAITM3                151
#define PMMODEL_WAITB0                152
#define WAITB                         153
#define PMMODEL_WAITB1                154
#define PMMODEH                       155
#define MODE0                         156
#define MODE1                         157
#define MODE16                        158
#define INCM0                         159
#define INCM1                         160
#define IRQM0                         161
#define IRQM1                         162
#define BUSY                          163
#define PMCONL                        164
#define RDSP                          165
#define WRSP                          166
#define BEP                           167
#define CS1P                          168
#define CS2P                          169
#define ALP                           170
#define CSF0                          171
#define CSF1                          172
#define PMCONH                        173
#define PTRDEN                        174
#define PTWREN                        175
#define PTBEEN                        176
#define ADRMUX0                       177
#define ADRMUX1                       178
#define PSIDL                         179
#define PMPEN                         180
#define DMABCH                        181
#define DMACNTHB                      182
#define DMABCL                        183
#define DMACNTLB                      184
#define RXADDRH                       185
#define DMARCPTRHB                    186
#define RXADDRL                       187
#define DMARCVPTRLB                   188
#define TXADDRH                       189
#define DMATXPTRHB                    190
#define TXADDRL                       191
#define DMATXPTRLB                    192
#define PMDIN1L                       193
#define PMDIN1L_DATAL                 194
#define PMDIN1H                       195
#define PMDIN1H_DATAH                 196
#define PMADDRL                       197
#define ADDRL                         198
#define PMDOUT1L                      199
#define PMADDRH                       200
#define CS1                           201
#define PMDOUT1H                      202
#define CMSTAT                        203
#define COUT1                         204
#define COUT2                         205
#define SSP2CON2                      206
#define SEN2                          207
#define SSP2CON2_SEN                  208
#define ADMSK12                       209
#define SSP2CON2_RSEN                 210
#define RSEN2                         211
#define SSP2CON2_ADMSK1               212
#define ADMSK22                       213
#define PEN2                          214
#define SSP2CON2_PEN                  215
#define SSP2CON2_ADMSK2               216
#define ADMSK32                       217
#define SSP2CON2_RCEN                 218
#define RCEN2                         219
#define SSP2CON2_ADMSK3               220
#define ACKEN2                        221
#define ADMSK42                       222
#define SSP2CON2_ADMSK4               223
#define SSP2CON2_ACKEN                224
#define ACKDT2                        225
#define ADMSK52                       226
#define SSP2CON2_ACKDT                227
#define SSP2CON2_ADMSK5               228
#define SSP2CON2_ACKSTAT              229
#define ACKSTAT2                      230
#define SSP2CON2_GCEN                 231
#define GCEN2                         232
#define SSP2CON1                      233
#define SSP2CON1_SSPM                 234
#define SSP2CON1_SSPM0                235
#define SSPM02                        236
#define SSPM12                        237
#define SSP2CON1_SSPM1                238
#define SSP2CON1_SSPM2                239
#define SSPM22                        240
#define SSPM32                        241
#define SSP2CON1_SSPM3                242
#define SSP2CON1_CKP                  243
#define CKP2                          244
#define SSPEN2                        245
#define SSP2CON1_SSPEN                246
#define SSPOV2                        247
#define SSP2CON1_SSPOV                248
#define WCOL2                         249
#define SSP2CON1_WCOL                 250
#define SSP2STAT                      251
#define SSP2STAT_BF                   252
#define BF2                           253
#define SSP2STAT_UA                   254
#define UA2                           255
#define RW2                           256
#define READ_WRITE2                   257
#define nW2                           258
#define I2C_READ2                     259
#define SSP2STAT_R_NOT_W              260
#define R_nW2                         261
#define nWRITE2                       262
#define R_W2                          263
#define SSP2STAT_R_nW                 264
#define SSP2STAT_S                    265
#define S2                            266
#define START2                        267
#define I2C_START2                    268
#define P2                            269
#define SSP2STAT_P                    270
#define STOP2                         271
#define I2C_STOP2                     272
#define I2C_DAT2                      273
#define DATA_ADDRESS2                 274
#define SSP2STAT_D_NOT_A              275
#define D_A2                          276
#define SSP2STAT_D_nA                 277
#define nA2                           278
#define DA2                           279
#define nADDRESS2                     280
#define D_nA2                         281
#define SSP2STAT_CKE                  282
#define CKE2                          283
#define SSP2STAT_SMP                  284
#define SMP2                          285
#define SSP2ADD                       286
#define SSP2ADD_SSPADD                287
#define MSK02                         288
#define SSP2ADD_MSK0                  289
#define MSK12                         290
#define SSP2ADD_MSK1                  291
#define MSK22                         292
#define SSP2ADD_MSK2                  293
#define MSK32                         294
#define SSP2ADD_MSK3                  295
#define MSK42                         296
#define SSP2ADD_MSK4                  297
#define MSK52                         298
#define SSP2ADD_MSK5                  299
#define MSK62                         300
#define SSP2ADD_MSK6                  301
#define MSK72                         302
#define SSP2ADD_MSK7                  303
#define SSP2BUF                       304
#define SSP2BUF_SSPBUF                305
#define T4CON                         306
#define T4CKPS0                       307
#define T4CKPS                        308
#define T4CKPS1                       309
#define TMR4ON                        310
#define T4OUTPS                       311
#define T4OUTPS0                      312
#define T4OUTPS1                      313
#define T4OUTPS2                      314
#define T4OUTPS3                      315
#define PR4                           316
#define TMR4                          317
#define T3CON                         318
#define TMR3ON                        319
#define T3CON_RD16                    320
#define T3SYNC                        321
#define T3CKPS0                       322
#define T3CKPS                        323
#define T3CKPS1                       324
#define TMR3CS                        325
#define TMR3CS0                       326
#define TMR3CS1                       327
#define T3RD16                        328
#define RD163                         329
#define TMR3L                         330
#define TMR3H                         331
#define BAUDCON2                      332
#define ABDEN2                        333
#define BAUDCON2_ABDEN                334
#define WUE2                          335
#define BAUDCON2_WUE                  336
#define BRG162                        337
#define BAUDCON2_BRG16                338
#define SCKP2                         339
#define TXCKP2                        340
#define BAUDCON2_TXCKP                341
#define DTRXP2                        342
#define RXDTP2                        343
#define BAUDCON2_RXDTP                344
#define RCMT2                         345
#define RCIDL2                        346
#define BAUDCON2_RCIDL                347
#define BAUDCON2_ABDOVF               348
#define ABDOVF2                       349
#define SPBRGH2                       350
#define BAUDCON1                      351
#define BAUDCON1_ABDEN                352
#define ABDEN1                        353
#define BAUDCON1_WUE                  354
#define WUE1                          355
#define W4E                           356
#define BRG161                        357
#define BAUDCON1_BRG16                358
#define CKTXP                         359
#define BAUDCON1_TXCKP                360
#define SCKP1                         361
#define TXCKP1                        362
#define SCKP                          363
#define DTRXP1                        364
#define RXDTP1                        365
#define DTRXP                         366
#define RXCKP                         367
#define BAUDCON1_RXDTP                368
#define RCMT1                         369
#define RCIDL1                        370
#define BAUDCON1_RCIDL                371
#define RCMT                          372
#define ABDOVF1                       373
#define BAUDCON1_ABDOVF               374
#define SPBRGH1                       375
#define PORTA                         376
#define C1INA                         377
#define AN0                           378
#define ULPWUIN                       379
#define ULPWU                         380
#define RP0                           381
#define RA0                           382
#define PMA6                          383
#define PMA7                          384
#define AN1                           385
#define RP1                           386
#define RA1                           387
#define C2INA                         388
#define CVREF_MINUS                   389
#define AN2                           390
#define RA2                           391
#define VREF_MINUS                    392
#define C2INB                         393
#define C1INB                         394
#define AN3                           395
#define VREF_PLUS                     396
#define RA3                           397
#define RCV                           398
#define AN4                           399
#define LVDIN                         400
#define NOT_SS1                       401
#define RP2                           402
#define RA5                           403
#define nSS1                          404
#define HLVDIN                        405
#define CLKO                          406
#define RA6                           407
#define OSC2                          408
#define CLKI                          409
#define RJPU                          410
#define RA7                           411
#define OSC1                          412
#define PORTB                         413
#define RB0                           414
#define INT0                          415
#define RP3                           416
#define AN12                          417
#define RB1                           418
#define RP4                           419
#define PMPBE                         420
#define RTCC                          421
#define AN10                          422
#define REFO                          423
#define PMA3                          424
#define RP5                           425
#define AN8                           426
#define RB2                           427
#define CTEDG1                        428
#define RP6                           429
#define PMA2                          430
#define AN9                           431
#define RB3                           432
#define CCP2_PA2                      433
#define CTEDG2                        434
#define PMA1                          435
#define RB4                           436
#define RP7                           437
#define KBI0                          438
#define PMA0                          439
#define RB5                           440
#define RP8                           441
#define KBI1                          442
#define PGC                           443
#define RB6                           444
#define RP9                           445
#define KBI2                          446
#define PGD                           447
#define RB7                           448
#define RP10                          449
#define KBI3                          450
#define PORTC                         451
#define T1CKI                         452
#define RP11                          453
#define T1OSO                         454
#define RC0                           455
#define CCP2                          456
#define RP12                          457
#define T1OSI                         458
#define PA2                           459
#define RC1                           460
#define CTPLS                         461
#define RP13                          462
#define PA1                           463
#define RC2                           464
#define AN11                          465
#define SCK1                          466
#define SCL1                          467
#define RP14                          468
#define RC3                           469
#define SDI1                          470
#define RP15                          471
#define RC4                           472
#define RP16                          473
#define SDO1                          474
#define RC5                           475
#define PMA5                          476
#define RP17                          477
#define TX1                           478
#define RC6                           479
#define CK1                           480
#define PMA4                          481
#define RP18                          482
#define RX1                           483
#define RC7                           484
#define DT1                           485
#define PORTD                         486
#define RD0                           487
#define SCL2                          488
#define PMD0                          489
#define RD1                           490
#define SDA2                          491
#define PMD1                          492
#define RD2                           493
#define RP19                          494
#define PMD2                          495
#define RD3                           496
#define PMD3                          497
#define RP20                          498
#define RD4                           499
#define PMD4                          500
#define RP21                          501
#define RD5                           502
#define PMD5                          503
#define RP22                          504
#define RD6                           505
#define PMD6                          506
#define RP23                          507
#define SS2                           508
#define RD7                           509
#define PMD7                          510
#define RP24                          511
#define PORTE                         512
#define AN5                           513
#define PD2                           514
#define PMPRD                         515
#define RDE                           516
#define RE0                           517
#define AN6                           518
#define WRE                           519
#define RE1                           520
#define PMPWR                         521
