tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf45j11_tdd.h
#define PSTR1CON_STRC                 1091
#define PSTR1CON_STRD                 1092
#define PSTR1CON_STRSYNC              1093
#define PSTR1CON_CMPL0                1094
#define PSTR1CON_CMPL1                1095
#define WDTCON                        1096
#define SWDTEN                        1097
#define SWDTE                         1098
#define ULPSINK                       1099
#define ULPEN                         1100
#define DS                            1101
#define ULPLVL                        1102
#define LVDSTAT                       1103
#define REGSLP                        1104
#define ADCON1                        1105
#define ADCS0                         1106
#define ADCS                          1107
#define ADCS1                         1108
#define ADCS2                         1109
#define ACQT0                         1110
#define ACQT                          1111
#define CHSN3                         1112
#define ACQT1                         1113
#define VCFG01                        1114
#define ACQT2                         1115
#define VCFG11                        1116
#define ADCON1_ADCAL                  1117
#define ADFM                          1118
#define ADCON0                        1119
#define ADON                          1120
#define nDONE                         1121
#define GO_nDONE                      1122
#define NOT_DONE                      1123
#define GODONE                        1124
#define GO_DONE                       1125
#define DONE                          1126
#define GO                            1127
#define GO_NOT_DONE                   1128
#define CHS                           1129
#define CHS0                          1130
#define CHS1                          1131
#define CHS2                          1132
#define CHS3                          1133
#define VCFG                          1134
#define VCFG0                         1135
#define VCFG1                         1136
#define ADCON0_ADCAL                  1137
#define ADRESL                        1138
#define ADRESH                        1139
#define SSP1CON2                      1140
#define SEN1                          1141
#define SSP1CON2_SEN                  1142
#define ADMSK11                       1143
#define SSP1CON2_RSEN                 1144
#define RSEN1                         1145
#define SSP1CON2_ADMSK1               1146
#define SSP1CON2_PEN                  1147
#define ADMSK21                       1148
#define PEN1                          1149
#define SSP1CON2_ADMSK2               1150
#define ADMSK31                       1151
#define RCEN1                         1152
#define SSP1CON2_RCEN                 1153
#define SSP1CON2_ADMSK3               1154
#define SSP1CON2_ACKEN                1155
#define ACKEN1                        1156
#define ADMSK41                       1157
#define SSP1CON2_ADMSK4               1158
#define ACKDT1                        1159
#define ADMSK51                       1160
#define SSP1CON2_ACKDT                1161
#define SSP1CON2_ADMSK5               1162
#define SSP1CON2_ACKSTAT              1163
#define ACKSTAT1                      1164
#define GCEN1                         1165
#define SSP1CON2_GCEN                 1166
#define SSP1CON1                      1167
#define SSP1CON1_SSPM0                1168
#define SSPM01                        1169
#define SSP1CON1_SSPM                 1170
#define SSP1CON1_SSPM1                1171
#define SSPM11                        1172
#define SSP1CON1_SSPM2                1173
#define SSPM21                        1174
#define SSPM31                        1175
#define SSP1CON1_SSPM3                1176
#define SSP1CON1_CKP                  1177
#define CKP1                          1178
#define SSPEN1                        1179
#define SSP1CON1_SSPEN                1180
#define SSPOV1                        1181
#define SSP1CON1_SSPOV                1182
#define WCOL1                         1183
#define SSP1CON1_WCOL                 1184
#define SSP1STAT                      1185
#define BF1                           1186
#define SSP1STAT_BF                   1187
#define SSP1STAT_UA                   1188
#define UA1                           1189
#define SSP1STAT_R_NOT_W              1190
#define READ_WRITE                    1191
#define RW1                           1192
#define NOT_W                         1193
#define I2C_READ                      1194
#define nW                            1195
#define RW                            1196
#define nWRITE                        1197
#define R                             1198
#define NOT_WRITE                     1199
#define R_W                           1200
#define SSP1STAT_R_nW                 1201
#define SSP1STAT_S                    1202
#define START                         1203
#define START1                        1204
#define I2C_START                     1205
#define STOP                          1206
#define SSP1STAT_P                    1207
#define STOP1                         1208
#define I2C_STOP                      1209
#define SSP1STAT_D_NOT_A              1210
#define NOT_A                         1211
#define SSP1STAT_D_nA                 1212
#define nA                            1213
#define D_A                           1214
#define D                             1215
#define DA1                           1216
#define DA                            1217
#define DATA_ADDRESS                  1218
#define NOT_ADDRESS                   1219
#define nADDRESS                      1220
#define I2C_DAT                       1221
#define SSP1STAT_CKE                  1222
#define CKE1                          1223
#define SSP1STAT_SMP                  1224
#define SMP1                          1225
#define SSP1ADD                       1226
#define SSP1ADD_SSPADD                1227
#define SSP1ADD_MSK0                  1228
#define MSK01                         1229
#define SSP1ADD_MSK1                  1230
#define MSK11                         1231
#define SSP1ADD_MSK2                  1232
#define MSK21                         1233
#define MSK31                         1234
#define SSP1ADD_MSK3                  1235
#define SSP1ADD_MSK4                  1236
#define MSK41                         1237
#define MSK51                         1238
#define SSP1ADD_MSK5                  1239
#define SSP1ADD_MSK6                  1240
#define MSK61                         1241
#define MSK71                         1242
#define SSP1ADD_MSK7                  1243
#define SSP1BUF                       1244
#define SSP1BUF_SSPBUF                1245
#define T2CON                         1246
#define T2CKPS0                       1247
#define T2CKPS                        1248
#define T2CKPS1                       1249
#define TMR2ON                        1250
#define T2OUTPS0                      1251
#define T2OUTPS                       1252
#define T2OUTPS1                      1253
#define T2OUTPS2                      1254
#define T2OUTPS3                      1255
#define WM0                           1256
#define PR2                           1257
#define WM1                           1258
#define WAIT0                         1259
#define WAIT1                         1260
#define EBDIS                         1261
#define TMR2                          1262
#define T1CON                         1263
#define TMR1ON                        1264
#define T1CON_RD16                    1265
#define T1SYNC                        1266
#define T1OSCEN                       1267
#define SOSCEN                        1268
#define T1CKPS0                       1269
#define T1CKPS                        1270
#define T1CKPS1                       1271
#define TMR1CS0                       1272
#define TMR1CS                        1273
#define T1RD16                        1274
#define TMR1CS1                       1275
#define TMR1L                         1276
#define TMR1H                         1277
#define RCON                          1278
#define BOR                           1279
#define NOT_BOR                       1280
#define nBOR                          1281
#define POR                           1282
#define nPOR                          1283
#define NOT_POR                       1284
#define PD                            1285
#define nPD                           1286
#define NOT_PD                        1287
#define nTO                           1288
#define TO                            1289
#define NOT_TO                        1290
#define nRI                           1291
#define NOT_RI                        1292
#define RI                            1293
#define NOT_CM                        1294
#define CM                            1295
#define nCM                           1296
#define IPEN                          1297
#define CM2CON                        1298
#define CM2CON_CCH                    1299
#define CM2CON_CCH0                   1300
#define CCH02                         1301
#define CCH12                         1302
#define CM2CON_CCH1                   1303
#define CM2CON_CREF                   1304
#define CREF2                         1305
#define CM2CON_EVPOL                  1306
#define EVPOL02                       1307
#define CM2CON_EVPOL0                 1308
#define EVPOL12                       1309
#define CM2CON_EVPOL1                 1310
#define CM2CON_CPOL                   1311
#define CPOL2                         1312
#define CM2CON_COE                    1313
#define COE2                          1314
#define CM2CON_CON                    1315
#define CON2                          1316
#define CM1CON                        1317
#define CM1CON_CCH                    1318
#define C1CH0                         1319
#define CM1CON_CCH0                   1320
#define CCH01                         1321
#define CCH11                         1322
#define C1CH1                         1323
#define CM1CON_CCH1                   1324
#define CM1CON_CREF                   1325
#define CREF1                         1326
#define EVPOL01                       1327
#define CM1CON_EVPOL0                 1328
#define CM1CON_EVPOL                  1329
#define CM1CON_EVPOL1                 1330
#define EVPOL11                       1331
#define CM1CON_CPOL                   1332
#define CPOL1                         1333
#define CM1CON_COE                    1334
#define COE1                          1335
#define CM1CON_CON                    1336
#define CON1                          1337
#define OSCCON                        1338
#define SCS0                          1339
#define SCS                           1340
#define SCS1                          1341
#define OSTS                          1342
#define IRCF                          1343
#define IRCF0                         1344
#define IRCF1                         1345
#define IRCF2                         1346
#define IDLEN                         1347
#define T0CON                         1348
#define T0PS                          1349
#define T0PS0                         1350
#define T0PS1                         1351
#define T0PS2                         1352
#define PSA                           1353
#define T0SE                          1354
#define T0CS                          1355
#define T08BIT                        1356
#define TMR0ON                        1357
#define TMR0L                         1358
#define TMR0H                         1359
#define STATUS                        1360
#define C                             1361
#define CARRY                         1362
#define DC                            1363
#define ZERO                          1364
#define Z                             1365
#define OV                            1366
#define OVERFLOW                      1367
#define N                             1368
#define NEGATIVE                      1369
#define FSR2L                         1370
#define PLUSW2                        1371
#define PREINC2                       1372
#define POSTDEC2                      1373
#define POSTINC2                      1374
#define INDF2                         1375
#define FSR1L                         1376
#define PLUSW1                        1377
#define PREINC1                       1378
#define POSTDEC1                      1379
#define POSTINC1                      1380
#define INDF1                         1381
#define WREG                          1382
#define FSR0L                         1383
#define PLUSW0                        1384
#define PREINC0                       1385
#define POSTDEC0                      1386
#define POSTINC0                      1387
#define INDF0                         1388
#define INTCON3                       1389
#define INT1IF                        1390
#define INT1F                         1391
#define INT2IF                        1392
#define INT2F                         1393
#define INT3F                         1394
#define INT3IF                        1395
#define INT1E                         1396
#define INT1IE                        1397
#define INT2IE                        1398
#define INT2E                         1399
#define INT3E                         1400
#define INT3IE                        1401
#define INT1P                         1402
#define INT1IP                        1403
#define INT2IP                        1404
#define INT2P                         1405
#define INTCON2                       1406
#define RBIP                          1407
#define INT3IP                        1408
#define INT3P                         1409
#define TMR0IP                        1410
#define T0IP                          1411
#define INTEDG3                       1412
#define INTEDG2                       1413
#define INTEDG1                       1414
#define INTEDG0                       1415
#define RBPU                          1416
#define NOT_RBPU                      1417
#define nRBPU                         1418
#define INTCON                        1419
#define RBIF                          1420
#define INT0F                         1421
#define INT0IF                        1422
#define T0IF                          1423
#define TMR0IF                        1424
#define RBIE                          1425
#define INT0E                         1426
#define INT0IE                        1427
#define T0IE                          1428
#define TMR0IE                        1429
#define PEIE                          1430
#define PEIE_GIEL                     1431
#define GIEL                          1432
#define GIE_GIEH                      1433
#define GIE                           1434
#define GIEH                          1435
#define PRODL                         1436
#define PRODH                         1437
#define TABLAT                        1438
#define TBLPTRL                       1439
#define TBLPTRH                       1440
#define PCL                           1441
#define PCLATH                        1442
#define PCH                           1443
#define SP0                           1444
#define STKPTR                        1445
#define SP1                           1446
#define SP2                           1447
#define SP3                           1448
#define SP4                           1449
#define STKUNF                        1450
#define STKOVF                        1451
#define STKFUL                        1452
#define TOSL                          1453
#define TOSH                          1454

#endif // _PIC18LF45J11_H_
